## Test

In [3]:
import numpy as np
import pandas as pd

In [4]:
d = {
    "c1" : [1,2,3,4,5],
    "c2" : [4,8,7,5,3],
    "c3" : [1,9,9,0,3]
}

In [5]:
df = pd.DataFrame(d)

In [6]:
df.head()

   c1  c2  c3
0   1   4   1
1   2   8   9
2   3   7   9
3   4   5   0
4   5   3   3

In [7]:
df.dtypes

c1    int64
c2    int64
c3    int64
dtype: object

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      5 non-null      int64
 1   c2      5 non-null      int64
 2   c3      5 non-null      int64
dtypes: int64(3)
memory usage: 248.0 bytes

In [9]:
df.describe()

             c1        c2        c3
count  5.000000  5.000000  5.000000
mean   3.000000  5.400000  4.400000
std    1.581139  2.073644  4.335897
min    1.000000  3.000000  0.000000
25%    2.000000  4.000000  1.000000
50%    3.000000  5.000000  3.000000
75%    4.000000  7.000000  9.000000
max    5.000000  8.000000  9.000000